Repository: tahmaz/c
Catalog: cars/cars_install/system/default.tmx
Source language: en_us
Languages: de_de, fr_fr, ja_jp

source: Lookup information for field '%s' is incomplete
de_de: Lookup-Information für Feld '%s' ist unvollständig
fr_fr: Informations de référence incomplètes pour le champ '%s'
ja_jp: 項目 '%s' の参照情報が不完全です

source: New Lookup Field
de_de: Neues Nachschlagefeld
fr_fr: Nouveau champ de référence
ja_jp: 参照項目の新規作成

source: DataSource cannot be changed
de_de: DataSource kann nicht geändert werden
fr_fr: Impossible de modifier DataSource
ja_jp: DataSource は変更できません

source: Nested datasets cannot have a MasterSource
de_de: Bei verschachtelten Datenmengen ist MasterSource nicht zulässig
fr_fr: Les datasets imbriqués ne peuvent avoir de MasterSource
ja_jp: ネストデータセットは MasterSource を持つことはできません

source: Cannot perform this operation on an open dataset
de_de: Operation bei geöffneter Datenmenge nicht ausführbar
fr_fr: Impossible d'effectuer cette opération sur un ensemble de données ouvert
ja_jp: データセットが開かれているため, この操作は実行できません

source: Dataset not in edit or insert mode
de_de: Datenmenge weder im Editier- noch im Einfügemodus
fr_fr: L'ensemble de données n'est pas en mode Edition ou Insertion
ja_jp: データセットが編集または挿入モードではありません

source: Field '%s' not found
de_de: Das Feld '%s' wurde nicht gefunden
fr_fr: Champ '%s' non trouvé
ja_jp: 項目 '%s' が見つかりません

source: Cannot access field '%s' as type %s
de_de: Feld '%s' kann nicht als Typ %s angesprochen werden
fr_fr: Impossible d'accéder au champ '%s' comme type %s
ja_jp: 項目 '%s' を %s 型としてアクセスすることはできません

source: Invalid value for field '%s'
de_de: Ungültiger Wert für Feld '%s'
fr_fr: Valeur incorrecte pour le champ '%s'
ja_jp: 項目 '%s' の値として不正です

source: %g is not a valid value for field '%s'. The allowed range is %g to %g
de_de: %g ist kein gültiger Wert für das Feld '%s'. Der zulässige Bereich ist %g bis %g
fr_fr: %g n'est pas une valeur correcte pour le champ '%s'. Les valeurs doivent être comprises entre %g et %g
ja_jp: %g は項目 '%s' に適した値ではありません。%g から %g の範囲が許されます

source: %s is not a valid value for field '%s'. The allowed range is %s to %s
de_de: %s ist kein gültiger Wert für Feld '%s'. Der zulässige Bereich ist %s bis %s
fr_fr: %s n'est pas une valeur correcte pour le champ '%s'. L'étendue autorisée est de %s à %s
ja_jp: %s は項目 '%s' に適した値ではありません。%s から %s の範囲が許されます

source: '%s' is not a valid integer value for field '%s'
de_de: '%s' ist kein gültiger Integerwert für Feld '%s'
fr_fr: '%s' n'est pas une valeur entière correcte pour le champ '%s'
ja_jp: '%s' は項目 '%s' に適した整数値ではありません

source: '%s' is not a valid boolean value for field '%s'
de_de: '%s' ist kein gültiger boolescher Wert für Feld '%s'
fr_fr: '%s' n'est pas une valeur booléenne correcte pour le champ '%s'
ja_jp: '%s' は項目 '%s' に適した論理値ではありません

source: '%s' is not a valid floating point value for field '%s'
de_de: '%s' ist kein gültiger Fließkommawert für Feld '%s'
fr_fr: '%s' n'est pas une valeur entière en virgule flottante correcte pour le champ '%s'
ja_jp: '%s' は項目 '%s' に適した浮動小数点数値ではありません

source: Type mismatch for field '%s', expecting: %s actual: %s
de_de: Unterschiedliche Typen für Feld '%s'; erwartet: %s, gefunden: %s
fr_fr: Type inadéquat pour le champ '%s', attendu : %s actuel : %s
ja_jp: 項目 '%s' の型が一致しません。期待値:%s 実際の値: %s

source: Size mismatch for field '%s', expecting: %d actual: %d
de_de: Unterschiedliche Größe für Feld '%s'; erwartet: %d, gefunden: %d
fr_fr: Taille inadéquate pour le champ '%s', attendue : %d actuelle : %d
ja_jp: 項目 '%s' の型が一致しません。期待値:%d 実際の値: %d

source: Invalid variant type or size for field '%s'
de_de: Variant-Typ oder -größe für Feld '%s' ist ungültig
fr_fr: Type ou taille de variant incorrect pour le champ '%s'
ja_jp: 項目 '%s' に適したバリアントではないか、サイズが異なります

source: Value of field '%s' is out of range
de_de: Wert des Feldes '%s' ist außerhalb des zulässigen Bereichs
fr_fr: La valeur du champ '%s' est hors limites
ja_jp: '%s' の値が範囲を超えました

source: Error adjusting BCD precision
de_de: Fehler beim Anpassen der BCD-Genauigkeit
fr_fr: Erreur en ajustant la précision BCD
ja_jp: BCD 精度の調整のエラー

source: Field '%s' must have a value
de_de: Feld '%s' muss einen Wert haben
fr_fr: Le champ '%s' doit avoir une valeur
ja_jp: 項目 '%s' の値が必要です

source: Field '%s' has no dataset
de_de: Feld '%s' hat keine Datenmenge
fr_fr: Le champ '%s' n'a pas d'ensemble de données
ja_jp: 項目 '%s' はデータセットを持っていません

source: Field '%s' cannot be a calculated or lookup field
de_de: Feld '%s' kann kein berechnetes oder Nachschlage-Feld sein
fr_fr: Le champ '%s' ne peut être un champ calculé ni un champ référence
ja_jp: 項目 '%s' は計算または参照項目にすることはできません。

source: The transaction isolation level must be dirty read for local databases
de_de: Die Isolationsebene für Transaktionen muss für lokale Datenbanken Dirty-Read sein.
fr_fr: Le niveau d'isolation de transaction doit être Lecture Dirty (dirty read) pour les bases locales
ja_jp: ローカル データベースに対してはトランザクション排他レベルを Dirty 読み取り (tiDirtyRead) にする必要があります

source: No provider available
de_de: Kein Provider verfügbar
fr_fr: Aucun fournisseur disponible
ja_jp: 有効なプロバイダがありません

source: Dataset is not a query
de_de: Die Datenmenge ist keine Abfrage
fr_fr: L'ensemble de données n'est pas une requête
ja_jp: データセットはクエリーではありません

source: %s class already registered
de_de: %s-Klasse ist bereits registriert
fr_fr: La classe %s est déjà recensée
ja_jp: %s クラスはすでに登録されています

source: %s class is not registered
de_de: %s-Klasse ist nicht registriert
fr_fr: La classe %s n'est pas recensée
ja_jp: %s クラスは登録されていません

source: %s class registered with a nil class reference
de_de: %s-Klasse wurde mit einer Klassenreferenz nil registriert
fr_fr: Classe %s recensée avec une référence de classe nil
ja_jp: クラス参照が nil の状態で %s クラスが登録されました

source: Cannot free TClassRegistry.ClassRegistry
de_de: TClassRegistry.ClassRegistry kann nicht freigegeben werden
fr_fr: Impossible de libérer TClassRegistry.ClassRegistry
ja_jp: TClassRegistry.ClassRegistry を解放できません

source: Invalid class reference for TAppletApplication
de_de: Ungültige Klassenreferenz für TAppletApplication
fr_fr: Référence de classe incorrecte pour TAppletApplication
ja_jp: 間違ったクラスが TAppletApplication に渡されました。

source: Invalid field size
de_de: Ungültige Feldgröße
fr_fr: Taille de champ incorrecte
ja_jp: 項目の大きさが不正です

source: Invalid FieldKind
de_de: FieldKind ungültig
fr_fr: FieldKind incorrect
ja_jp: FieldKind が異なります

source: Invalid field registration
de_de: Ungültige Feldregistrierung
fr_fr: Enregistrement de champ incorrect
ja_jp: 項目の登録エラー

source: Field '%s' is of an unknown type
de_de: Typ für Feld '%s' ist unbekannt
fr_fr: Le champ '%s' est d'un type inconnu
ja_jp: 項目 '%s' の型がわかりません

source: Field name missing
de_de: Feldname fehlt
fr_fr: Nom de champ manquant
ja_jp: 項目名がありません

source: Duplicate field name '%s'
de_de: Doppelter Feldname '%s'
fr_fr: Nom de champ dupliqué '%s'
ja_jp: 項目名 '%s' が重複しています

source: %s%s%s Index Files
de_de: %s%s%s Indexdateien
fr_fr: Fichiers index %s%s%s
ja_jp: %s%s%s のインデックス ファイル

source: (None)
de_de: (Ohne)
fr_fr: (vide)
ja_jp: (なし)

source: Index does not exist. Index: %s
de_de: Index existiert nicht. Index: %s
fr_fr: L'index n'existe pas. Index : %s
ja_jp: インデックスがありません。インデックス: %s

source: E&xecute
de_de: &Ausführen
fr_fr: Exé&cuter
ja_jp: 実行(&X)

source: Invalid alias name %s
de_de: Ungültiger Aliasname %s
fr_fr: Nom d'alias %s incorrect
ja_jp: 無効なエイリアス名 %s

source: Cannot access field '%s' in a filter
de_de: Auf Feld '%s' kann in einem Filter nicht zugegriffen werden
fr_fr: Impossible d'accéder au champ '%s' dans un filtre
ja_jp: フィルターから '%s' 項目を参照することはできません

source: No dataset association
de_de: Keine Datenmengenverknüpfung
fr_fr: Aucune association d'ensemble de données
ja_jp: データセット未指定

source: Untitled Application
de_de: Unbenannte Anwendung
fr_fr: Application sans titre
ja_jp: (名称未設定)

source: Cannot update, %s is not owned by %s
de_de: Aktualisierung nicht möglich, %s gehört zu %s
fr_fr: Impossible de mettre à jour, %s n'appartient pas à %s
ja_jp: アップデートできません。%1:s は %0:s を所有していません

source: Update failed
de_de: Aktualisierung misslungen
fr_fr: Echec de la mise à jour
ja_jp: アップデート失敗

source: Must select at least one key field and one update field
de_de: Sie müssen mindestens ein Schlüsselfeld und ein Updatefeld auswählen
fr_fr: Vous devez sélectionner au moins un champ clé et un champ de mise à jour
ja_jp: 少なくとも一つのキー項目とアップデート対象項目を指定しなければなりません

source: Update SQL statements not generated, exit anyway?
de_de: Aktualisierungs-SQL-Anweisungen nicht generiert; trotzdem beenden
fr_fr: Instructions Update SQL non générée, sortir quand même ?
ja_jp: SQL 文が生成されていません。閉じてよいですか？

source: Unable to open the MasterSource Table
de_de: MasterSource-Tabelle kann nicht geöffnet werden
fr_fr: Impossible d'ouvrir la table MasterSource
ja_jp: MasterSource プロパティで定義されたテーブルを開けません

source: Define &Parameters...
de_de: &Parameter definieren...
fr_fr: &Définir les paramètres...
ja_jp: パラメータの定義(&P)...

source: Database is currently connected. Disconnect and continue?
de_de: Die Datenbank ist verbunden. Verbindung beenden und weitermachen?
fr_fr: La base est actuellement connectée. Déconnecter et continuer ?
ja_jp: 現在データベースと接続しています。切断してから続けますか？

source: BDE error $%.4x
de_de: BDE-Fehler $%.4x
fr_fr: Erreur BDE $%.4x
ja_jp: BDEエラー $%.4x

source: Unable to use duplicate DataSource and LookupSource
de_de: Kann doppelte DataSource und LookupSource nicht benutzen
fr_fr: Impossible d'utiliser DataSource et LookupSource dupliqués
ja_jp: DataSource と LookupSource が重複してはいけません

source: LookupSource must be connected to TTable component
de_de: LookupSource muss mit TTable-Komponente verbunden werden
fr_fr: LookupSource doit être connecté au composant TTable
ja_jp: LookupSource は TTable コンポーネントに接続していなければなりません

source: %s must be the lookup table's active index
de_de: %s muss der aktive Index der Nachschlagetabelle sein.
fr_fr: %s doit être l'index actif de la table de référence
ja_jp: %s は参照テーブルの有効なインデックスでなければなりません

source: Must have a valid field type selected
de_de: Sie müssen einen gültigen Feldtypen auswählen
fr_fr: Un type de champ correct doit être sélectionné
ja_jp: 有効な型を指定しなければなりません

source: Parameter '%s' truncated on output
de_de: Parameter '%s' wurde bei Ausgabe abgeschnitten
fr_fr: Paramètre '%s' tronqué en sortie
ja_jp: パラメータ '%s' の出力時に丸められました

source: %s%s%s Database
de_de: %s%s%s Datenbanken
fr_fr: Base de données %s%s%s
ja_jp: %s%s%s データベース

source: %s%s%s Parameters
de_de: %s%s%s Parameter
fr_fr: Paramètres %s%s%s
ja_jp: %s%s%s パラメータ

source: Cannot convert field '%s' to a floating point value
de_de: Feld '%s' kann nicht in Fließkommawert konvertiert werden
fr_fr: Impossible de convertir le champ '%s' en valeur flottante
ja_jp: 項目 '%s' を浮動小数点数型に変換できません

source: Cannot convert field '%s' to an integer value
de_de: Feld '%s' kann nicht in Integerwert konvertiert werden
fr_fr: Impossible de convertir le champ '%s' en valeur entière
ja_jp: 項目 '%s' を整数型に変換できません

source: Source and destination tables are incompatible
de_de: Quell- und Zieltabellen sind inkompatibel
fr_fr: Les tables source et destination sont incompatibles
ja_jp: 転送元と転送先のテーブルが一致していません

source: Fields '%s' and '%s' are not assignment compatible
de_de: Die Felder '%s' und '%s' sind nicht zuweisungskompatibel
fr_fr: Les champs '%s' et '%s' ne sont pas compatibles pour une affectation
ja_jp: 項目 '%s' と項目 '%s' の間には代入互換性がありません

source: ReferenceTableName not specified for field '%s'
de_de: Für Feld '%s' wurde kein Referenztabellenname angegeben
fr_fr: Table de référence non spécifiée pour le champ '%s'
ja_jp: 項目 '%s' のための ReferenceTableName が指定されていません

source: Cannot use array of Field values with Expression Indices
de_de: Ein Array von Feldwerten kann nicht mit auf Ausdrücken basierenden Indizes verwendet werden
fr_fr: Impossible d'utiliser un tableau de valeurs champs avec des Indices Expression
ja_jp: 式インデックスでは項目値を探すことはできません

source: Invalid batch move parameters
de_de: Ungültige Batch-Move-Parameter
fr_fr: Paramètres de déplacement batch incorrects
ja_jp: バッチ移動のパラメータが不正です

source: An error occurred while attempting to initialize the Borland Database Engine (error $%.4x)
de_de: Bei der Initialisierung der Borland Database Engine ist ein Fehler aufgetreten (Fehler $%.4x)
fr_fr: Une erreur est survenue lors de l'initialisation du Borland Database Engine (erreur $%.4x)
ja_jp: Borland Database Engine の初期化中にエラーが発生しました (エラー $%.4x)

source: Da&tabase Editor...
de_de: &Datenbank-Editor...
fr_fr: Edite&ur de base de données...
ja_jp: 接続設定(&T)...

source: E&xplore
de_de: E&xplorer
fr_fr: Exp&lorateur
ja_jp: エクスプローラ(&X)

source: '%s' cannot be opened
de_de: '%s' kann nicht geöffnet werden
fr_fr: '%s' ne peut être ouvert
ja_jp: '%s' を開くことができません.

source: The MasterSource property of '%s' must be linked to a DataSource
de_de: Die MasterSource-Eigenschaft von '%s' muss mit einer DataSource verbunden sein.
fr_fr: La propriété MasterSource de '%s' doit être liée à une source de données
ja_jp: '%s' の MasterSource プロパティがデータソースを指している必要があります。

source: Recordset is not open
de_de: Recordset ist nicht geöffnet
fr_fr: Recordset non ouvert
ja_jp: レコードセットが開いていません。

source: Cannot enable AutoSessionName property with more than one session on a form or data-module
de_de: Die Eigenschaft AutoSessionName kann nicht aktiviert werden, wenn sich mehr als eine Session in einem Formular oder einem Datenmodul befinden
fr_fr: Impossible d'activer la propriété AutoSessionName si plusieurs sessions sont sur une fiche ou un module de données
ja_jp: フォームまたはデータモジュールに複数のセッションが存在する場合は AutoSessionName プロパティを有効にはできません

source: Cannot add a session to the form or data-module while session '%s' has AutoSessionName enabled
de_de: Einem Formular oder Datenmodul kann keine Session hinzugefügt werden, da Session '%s' AutoSessionName aktiviert hat
fr_fr: Impossible d'ajouter une session à la fiche ou au module de données tant que la session '%s' a AutoSessionName activé
ja_jp: セッション '%s' の AutoSessionName が有効な間はフォームまたはデータモジュールに別のセッションを追加できません

source: Cannot modify SessionName while AutoSessionName is enabled
de_de: Während AutoSessionName aktiviert ist, kann SessionName nicht geändert werden.
fr_fr: Impossible de modifier SessionName tant que AutoSessionName est activé
ja_jp: AutoSessionName が有効な間は SessionName を変更できません。

source: Duplicate database name '%s'
de_de: Doppelter Datenbankname '%s'
fr_fr: Nom de base de données dupliqué '%s'
ja_jp: データベース名 '%s' が衝突しています

source: Duplicate session name '%s'
de_de: Doppelter Name für eine Sitzung: '%s'
fr_fr: Nom de session dupliqué '%s'
ja_jp: セッション名 '%s' が衝突しています

source: Invalid session name %s
de_de: Ungültiger Sitzungsname %s
fr_fr: Nom de session %s incorrect
ja_jp: セッション名 %s が不正です

source: Database name missing
de_de: Datenbankname fehlt
fr_fr: Nom de base de données manquant
ja_jp: データベース名がありません

source: Session name missing
de_de: Name der Sitzung fehlt
fr_fr: Nom de session manquant
ja_jp: セッション名がありません

source: Cannot perform this operation on an open database
de_de: Operation bei geöffneter Datenbank nicht ausführbar
fr_fr: Impossible d'effectuer cette opération sur une base de données ouverte
ja_jp: データベースが開かれているため, この操作は実行できません

source: Cannot perform this operation on a closed database
de_de: Operation bei geschlossener Datenbank nicht ausführbar
fr_fr: Impossible d'effectuer cette opération sur une base de données fermée
ja_jp: データベースは閉じているため, この操作は実行できません

source: Database handle owned by a different session
de_de: Datenbank-Handle gehört zu einer anderen Sitzung
fr_fr: Le handle de base de données appartient à une autre session
ja_jp: データベース ハンドルは別のセッションに所有されています

source: Cannot perform this operation on an active session
de_de: Diese Operation kann auf eine aktive Sitzung nicht angewendet werden
fr_fr: Impossible d'effectuer cette opération sur une session active
ja_jp: 有効なセッションに対しては, この操作は実行できません

source: Error creating cursor handle
de_de: Fehler beim Erstellen des Cursor-Handle
fr_fr: Erreur à la création du handle de curseur
ja_jp: カーソルハンドルの作成でエラーが発生しました

source: Action does not provide response
de_de: Aktion sieht keine Antwort vor
fr_fr: L'action ne fournit aucune réponse.
ja_jp: アクションはレスポンスを提供していません。

source: Action can't respone to unknown HTTP method
de_de: Aktion kann nicht auf unbekannte HTTP -Methode antworten
fr_fr: L'action ne peut pas répondre à une méthode HTTP inconnue.
ja_jp: 未知の HTTP メソッドのため、アクションはレスポンスを返せません。

source: Action can't redirect to blank URL
de_de: Aktion kann nicht zu leerer URL umleiten
fr_fr: L'action ne peut pas effectuer de redirection vers une URL vierge.
ja_jp: アクションは空の URL へのリダイレクトを許していません

source: Invalid Enum Value
de_de: Ungültiger Enum-Wert
fr_fr: Valeur enum incorrecte
ja_jp: 列挙値が無効です

source: Missing Connection or ConnectionString
de_de: Fehlende Connection oder ConnectionString
fr_fr: Valeur Connection ou ConnectionString manquante
ja_jp: Connection または ConnectionString プロパティが指定されていません。

source: Filter property cannot be used for detail tables
de_de: Die Filter-Eigenschaft kann nicht bei Detail-Tabellen verwendet werden
fr_fr: Impossible d'utiliser la propriété Filter pour les tables détail
ja_jp: Filter プロパティは詳細テーブルでは利用できません。

source: Dataset does not support bookmarks, which are required for multi-record data controls
de_de: Die Datenmenge unterstützt keine Positionsmarken, die von Multi-Datensatz-Elementen benötigt werden.
fr_fr: L'ensemble de données ne supporte pas les signets (bookmark), qui sont requis pour les contrôles de données multi-enregistrement
ja_jp: このデータセットは複数レコードデータを管理するために必要なブックマーク機能をサポートしていません。

source: Missing %s property
de_de: Eigenschaft %s fehlt
fr_fr: Propriété %s manquante
ja_jp: %s プロパティが指定されていません。

source: CommandText does not return a result set
de_de: CommandText gibt keine Ergebnismenge zurück
fr_fr: CommandText ne renvoie pas un ensemble de résultats
ja_jp: CommandText は結果セットを返しません。

source: Error creating object. Please verify that the Microsoft Data Access Components 2.1 (or later) have been properly installed
de_de: Fehler bei der Objekterzeugung. Stellen Sie sicher, dass die Microsoft Data Access Components 2.1 (oder höher) richtig installiert sind
fr_fr: Erreur à la création de l'objet. Vérifiez que les composants Microsoft Data Access 2.1 (ou supérieur) ont été correctement installés
ja_jp: オブジェクトの作成エラー。Microsoft Data Access Components 2.1 またはそれ以降の版が正しくインストールされているか確認してください。

source: Events are not supported with server side TableDirect cursors
de_de: Ereignisse werden nicht mit server-seitigen TableDirect-Cursorn unterstützt
fr_fr: Les événements ne sont pas supportés avec les curseurs TableDirect côté serveur
ja_jp: サーバーサイド TableDirect カーソルではイベントはサポートされていません。

source: Unsupported field type (%s) in field %s
de_de: Nicht unterstützter Feldtyp (%s) in Feld %s
fr_fr: Type de champ non supporté (%s) dans le champ %s
ja_jp: 項目 %1:s はサポートされていない種類（%0:s）です。

source: No matching ADO data type for %s
de_de: Kein passender ADO-Datentyp für %s
fr_fr: Aucun type de données ADO correspondant pour %s
ja_jp: %s に対応する ADO データ型がありません。

source: A connection component is required for async ExecuteOptions
de_de: Für asynchrone ExecuteOptions wird eine Verbindungskomponente erwartet
fr_fr: Un composant connexion est requis pour ExecuteOptions asynchrone
ja_jp: ExecuteOptions プロパティに非同期接続（async）を指定した場合は Connection プロパティを指定する必要があります。

source: Cannot perform a requery after connection has changed
de_de: Nach Wechsel der Verbindung kann keine Abfrage durchgeführt werden
fr_fr: Impossible d'effectuer une requête après le changement de connexion
ja_jp: 接続を変更した場合には再問い合わせ（ReQuery）を行うことはできません。

source: FilterOptions are not supported
de_de: Filteroptionen werden nicht unterstützt
fr_fr: FilterOptions non prises en charge
ja_jp: FilterOptions はサポートされていません

source: Parameter expected
de_de: Parameter erwartet
fr_fr: Paramètre attendu
ja_jp: パラメータが必要

source: String parameter expected
de_de: String-Parameter erwartet
fr_fr: Paramètre chaîne attendu
ja_jp: 文字列パラメータが必要

source: Invalid image (the size is less than 4 bytes long).
de_de: Ungültige Grafik (die Größe ist geringer als 4 Byte).
fr_fr: Image incorrecte (la taille est inférieure à 4 octets).
ja_jp: イメージの大きさは４バイト以下で無ければならない。

source: File include error on line %d: expecting "
de_de: include-Dateifehler auf Zeile %d: erwartet "
fr_fr: Le fichier contient une erreur en ligne %d: attendu "
ja_jp: ファイルのインクルード時のエラー。%d 行目 : 以下の文字列が現れることを期待しました - "

source: File include error on line %d: expecting =
de_de: include-Dateifehler auf Zeile %d: erwartet =
fr_fr: Le fichier contient une erreur en ligne %d: attendu =
ja_jp: ファイルのインクルード時のエラー。%d 行目 : = を期待しました。

source: File include error on line %d: expecting virtual, file, or page, but found %s.
de_de: include-Dateifehler auf Zeile %d: erwartet virtual, Datei, oder Seite, aber %s gefunden.
fr_fr: Le fichier contient une erreur en ligne %d: virtuel, fichier ou page attendu, mais %s trouvé.
ja_jp: ファイルのインクルード時のエラー。%d 行目 : virtual, file, または page がくるべきところに %s が現れました。

source: unknown
de_de: Unbekannt
fr_fr: inconnu
ja_jp: 不明

source: Component %s not found
de_de: Komponente %s nicht gefunden
fr_fr: Composant %s non trouvé
ja_jp: コンポーネント %s が見つかりません

source: Getting the Count of a TComponentsEnumerator object is not supported
de_de: Das Lesen von Count eines TComponentsEnumerator-Objekts wiurd nicht unterstützt
fr_fr: Impossible d'obtenir le décompte d'un objet TComponentsEnumerator
ja_jp: TComponentsEnumerator オブジェクとのカウントの取得はサポートされていません。

source: Component was expected to implement IInterfaceComponentReference for ValuesList support
de_de: Es wurde erwartet, dass die Komponente zur Unterstützung von ValuesList IInterfaceComponentReference implementiert
fr_fr: Le composant devait implémenter IInterfaceComponentReference pour supporter ValuesList
ja_jp: コンポーネントは ValuesList のサポートのために IInterfaceComponentReference を実装することを期待されています。

source: Errors object must support the interface IIterateIntfSupport
de_de: Fehlerobjekte müssen das Interface IIterateIntfSupport unterstützen
fr_fr: Les objets erreurs doivent supporter l'interface IIterateIntfSupport
ja_jp: エラー オブジェクトは IIterateIntfSupport インターフェイスをサポートしなければなりません。

source: Type mismatch in parameter %d for method %s
de_de: Keine Übereinstimmung in Parameter %d für Methode %s
fr_fr: Non concordance de type dans le paramètre %d de la méthode %s
ja_jp: メソッド %1:s のパラメータ %0:d の型が一致しません

source: Invalid DispID for parameter %d in method %s
de_de: Ungültige DispID für Parameter %d in Methode %s
fr_fr: DispID incorrect pour le paramètre %d de la méthode %s
ja_jp: %1:s メソッドのパラメータ %0:d の DispID が無効です

source: Parameter %d required for method %s
de_de: Parameter %d erforderlich für Methode %s
fr_fr: Paramètre %d requis pour la méthode %s
ja_jp: メソッド %1:s にはパラメータ %0:d が必要です

source: Method definition for %s has over %d parameters
de_de: Methodendefinition für %s hat mehr als %d Parameter
fr_fr: La définition de la méthode %s a plus de %d paramètres
ja_jp: メソッドの定義 %s に余分なパラメータ %d があります

source: Too many parameters for method %s
de_de: Zu viele Parameter für Methode %s
fr_fr: Trop de paramètres pour la méthode %s
ja_jp: %s メソッドのパラメータが多すぎます

source: Cannot create script engine: %s. Error: %x
de_de: Script-Engine kann nicht erzeugt werden: %s. Fehler: %x
fr_fr: Impossible de créer le moteur de script : %s. Erreur : %x
ja_jp: スクリプトエンジン %s が作成できません。エラー： %x

source: Cannot initialize script engine
de_de: Script-Engine kann nicht initialisiert werden
fr_fr: Impossible d'initialiser le moteur de script
ja_jp: スクリプトエンジンを初期化できません。

source: Script engine not found: %s.
de_de: Script-Engine nicht gefunden: %s.
fr_fr: Moteur de script non trouvé : %s.
ja_jp: スクリプトエンジン %s が見つかりません。

source: Script Object expected
de_de: Script-Objekt erwartet
fr_fr: Objet Script attendu
ja_jp: スクリプトオブジェクトが必要

source: Integer parameter expected
de_de: Integer-Parameter erwartet
fr_fr: Paramètre entier attendu
ja_jp: 整数パラメータが必要

source: Unexpected parameter type
de_de: Unerwarteter Parametertyp
fr_fr: Type de paramètre inattendu
ja_jp: パラメータの型が判断できない
